UNFCOPY.саУНФУправлениеАссортиментом/src/AccumulationRegisters/ДенежныеСредстваВКассахККМ/ДенежныеСредстваВКассахККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="11ec31ba-bdd6-47cd-9b54-fc73e9615ad8">
  <name>ДенежныеСредстваВКассахККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="31935489-d3dc-4f0a-b8ea-6c1599a638d3">
    <name>СуммаВал</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="24b0c9e5-7e7f-479e-900c-24614a872719">
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8d080f3c-06ed-48bf-9709-eea73d676741">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="a84a91d2-d326-4bf4-82e6-d573ee35d090">
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="57b31a5d-9fdc-43d2-ae81-67157822c4b6">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d4e2da66-9a70-459f-a873-cb4ad71d17b2">
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/СтруктурныеЕдиницы/СтруктурныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ed14c926-38a5-4a0b-b570-c106d8d9419d">
  <name>СтруктурныеЕдиницы</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>саУНФ_КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_ФорматМагазина</name>
    <type>
      <types>CatalogRef.саУНФ_ФорматыМагазинов</types>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_ГрафикДоставки</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыМагазиновИФилиалов</types>
    </type>
  </attributes>
  <attributes>
    <name>AK_Филиал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="b686b923-618b-447b-a283-0f23b5d8d988">
    <name>ТипСтруктурнойЕдиницы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2476bac7-ac47-4539-b1e8-e2d3bf18251a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a579788-8f60-4358-a54a-2a1b02be6ac8">
    <name>ИсточникПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="435125b2-101c-4eae-ad45-b084a33b0510">
    <name>РозничныйВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>саУНФ_ЛетнееРасписание</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыРТТ</types>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_ЗимнееРасписание</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыРТТ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДоставки</name>
    <type>
      <types>CatalogRef.ЗоныТарифыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_СезонЗима</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="97b4ad24-7fe0-4089-81be-fde2f291bf9d">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="403e370d-5c7d-4010-93e7-ea8729e934a9">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="64ffead8-4404-4f60-8592-b4020b98da25">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6eaeb4e5-7d2d-492d-98cb-c3be6dba9e72">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="62c9addc-f9c5-4262-8192-a7d73e71f636">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="593279ce-6c0c-4900-9429-d5cb335b4d23">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0968bf2f-4915-4a51-baeb-24e37a11f128">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fd4a9e59-595c-4e13-b2e8-facee41c4a11">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fa1ef4b3-fc76-4b08-bb66-d89a7a1b66b1">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9c1325af-7492-42be-b3af-51b692534510">
    <name>ИдентификаторПользователяИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="d6969c1e-e13c-4542-abb7-9cf6bb50b8e2">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ccd91f94-d3f1-4aa3-90cf-081d72c4cab1">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aa7d5ca4-3c02-4ca1-a790-2435ee9f9f02">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b7e85f5c-4312-44c6-895a-3f636a8c78d8">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6534ea96-2145-49e6-9739-f59459dc7f6b">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UNFCOPY.саУНФУправлениеАссортиментом/src/CommonModules/саУНФ_ДеньгиКассы/Module.bsl
Функция ОстаткиВКассах(ДатаОбработки,КассаККМ=Неопределено) Экспорт
	ПараметрыСтроки = Новый КвалификаторыСтроки(50);
	
	ТаблицаМайлов = Новый ТаблицаЗначений;
	ТаблицаМайлов.Колонки.Добавить("РуководительПодразделения",Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаМайлов.Колонки.Добавить("АдресЭП", Новый ОписаниеТипов("Строка",,,,ПараметрыСтроки));
	ТаблицаМайлов.Колонки.Добавить("КопияЭП", Новый ОписаниеТипов("Строка"));

	
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст="ВЫБРАТЬ
	             |	СтруктурныеЕдиницы.Ссылка КАК Магазин,
	             |	&G1 КАК РуководительПодразделения
	             |ПОМЕСТИТЬ ВТ_МАГАЗИНЫ
	             |ИЗ
	             |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы.ДополнительныеРеквизиты КАК СтруктурныеЕдиницыДополнительныеРеквизиты
	             |		ПО (СтруктурныеЕдиницыДополнительныеРеквизиты.Свойство.Имя ПОДОБНО ""%ДействующийМагазин%"")
	             |			И (ТИПЗНАЧЕНИЯ(СтруктурныеЕдиницыДополнительныеРеквизиты.Значение) = ТИП(БУЛЕВО))
	             |			И (СтруктурныеЕдиницыДополнительныеРеквизиты.Значение = ИСТИНА)
	             |			И СтруктурныеЕдиницы.Ссылка = СтруктурныеЕдиницыДополнительныеРеквизиты.Ссылка
	             |			И (&G2)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЕСТЬNULL(ПользователиКонтактнаяИнформация.АдресЭП, """") КАК АдресЭП,
	             |	ВТ_МАГАЗИНЫ.РуководительПодразделения КАК РуководительПодразделения,
	             |	ВТ_МАГАЗИНЫ.Магазин КАК Магазин
	             |ПОМЕСТИТЬ ВТ_АДРЕСАПОЧТЫ
	             |ИЗ
	             |	ВТ_МАГАЗИНЫ КАК ВТ_МАГАЗИНЫ
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	             |		ПО ВТ_МАГАЗИНЫ.РуководительПодразделения = ПользователиКонтактнаяИнформация.Ссылка
	             |			И (ПользователиКонтактнаяИнформация.Тип = &ТипКИ)
	             |			И (ПользователиКонтактнаяИнформация.Вид = &ВидКИ)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ВТ_АДРЕСАПОЧТЫ.РуководительПодразделения КАК РуководительПодразделения,
	             |	ВТ_АДРЕСАПОЧТЫ.АдресЭП КАК АдресЭП
	             |ИЗ
	             |	ВТ_АДРЕСАПОЧТЫ КАК ВТ_АДРЕСАПОЧТЫ";
	
	Запрос.Текст=СтрЗаменить(Запрос.Текст,"&G1","ЕСТЬNULL(СтруктурныеЕдиницы.bp3_РуководительПодразделения,ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))");			 
	Запрос.УстановитьПараметр(	"ТипКИ",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр(	"ВидКИ",Справочники.ВидыКонтактнойИнформации.EmailПользователя);

	Если ЗначениеЗаполнено(КассаККМ) Тогда
	         Запрос.Текст=СтрЗаменить(Запрос.Текст,"И (&G2)","ГДЕ СтруктурныеЕдиницы.Ссылка = &СтруктурнаяЕдКассы");
		     Запрос.УстановитьПараметр("СтруктурнаяЕдКассы",КассаККМ.СтруктурнаяЕдиница);
	Иначе	
	        Запрос.Текст=СтрЗаменить(Запрос.Текст,"И (&G2)","");
	КонецЕсли;

    ТаблицаАдресов = Запрос.Выполнить().Выгрузить();
	Для каждого  СтрокаТА Из ТаблицаАдресов Цикл
	        СписокПоиска = Новый Структура("РуководительПодразделения",СтрокаТА.РуководительПодразделения);
		    МассивТаблицаМайлов = ТаблицаМайлов.НайтиСтроки(СписокПоиска); 
			Если МассивТаблицаМайлов.Количество()>0 Тогда
			        Если  ЗначениеЗаполнено(МассивТаблицаМайлов[0].АдресЭП) Тогда
						Если  ЗначениеЗаполнено(МассивТаблицаМайлов[0].КопияЭП) Тогда
							МассивТаблицаМайлов[0].КопияЭП=МассивТаблицаМайлов[0].КопияЭП+";"+СОКРЛП(СтрокаТА.АдресЭП);
						Иначе
							МассивТаблицаМайлов[0].КопияЭП=СОКРЛП(СтрокаТА.АдресЭП);
						КонецЕсли; 			
					КонецЕсли; 
			Иначе	
			        НоваяСтрока =  ТаблицаМайлов.Добавить();
					НоваяСтрока.РуководительПодразделения =  СтрокаТА.РуководительПодразделения;
					НоваяСтрока.АдресЭП =  СОКРЛП(СтрокаТА.АдресЭП);
			КонецЕсли; 
	
	КонецЦикла; 
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст="ВЫБРАТЬ
	             |	ТаблицаМайлов.РуководительПодразделения КАК РуководительПодразделения,
	             |	ТаблицаМайлов.АдресЭП КАК АдресЭП,
	             |	ТаблицаМайлов.КопияЭП КАК КопияЭП
	             |ПОМЕСТИТЬ ВТ_ТАБМАЙЛОВ
	             |ИЗ
	             |	&ТаблицаМайлов КАК ТаблицаМайлов
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_МАГАЗИНЫ.Магазин КАК Магазин,
	             |	ВТ_МАГАЗИНЫ.РуководительПодразделения КАК РуководительПодразделения,
	             |	ВТ_ТАБМАЙЛОВ.АдресЭП КАК АдресЭП
	             |ПОМЕСТИТЬ ВТ_АДРЕСАПОЧТЫ2
	             |ИЗ
	             |	ВТ_МАГАЗИНЫ КАК ВТ_МАГАЗИНЫ
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТАБМАЙЛОВ КАК ВТ_ТАБМАЙЛОВ
	             |		ПО ВТ_МАГАЗИНЫ.РуководительПодразделения = ВТ_ТАБМАЙЛОВ.РуководительПодразделения
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_АДРЕСАПОЧТЫ2.АдресЭП КАК АдресЭП,
	             |	ВТ_АДРЕСАПОЧТЫ2.РуководительПодразделения КАК Руководитель,
	             |	ВТ_АДРЕСАПОЧТЫ2.Магазин КАК Магазин,
	             |	ДенежныеСредстваВКассахККМОстатки.КассаККМ КАК КассаККМ,
	             |	СУММА(ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаВалОстаток, 0)) КАК Сумма,
	             |	ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаВалОстаток, 0) - 1000 КАК СуммаПревышения
	             |ИЗ
	             |	ВТ_АДРЕСАПОЧТЫ2 КАК ВТ_АДРЕСАПОЧТЫ2
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
	             |				&Период,
	             |				КассаККМ.СтруктурнаяЕдиница В
	             |					(ВЫБРАТЬ
	             |						ВТ_АДРЕСАПОЧТЫ2.Магазин КАК Магазин
	             |					ИЗ
	             |						ВТ_АДРЕСАПОЧТЫ2 КАК ВТ_АДРЕСАПОЧТЫ2)) КАК ДенежныеСредстваВКассахККМОстатки
	             |		ПО ВТ_АДРЕСАПОЧТЫ2.Магазин = ДенежныеСредстваВКассахККМОстатки.КассаККМ.СтруктурнаяЕдиница
	             |			И (ДенежныеСредстваВКассахККМОстатки.СуммаВалОстаток > 1000)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ДенежныеСредстваВКассахККМОстатки.КассаККМ,
	             |	ВТ_АДРЕСАПОЧТЫ2.Магазин,
	             |	ВТ_АДРЕСАПОЧТЫ2.АдресЭП,
	             |	ВТ_АДРЕСАПОЧТЫ2.РуководительПодразделения,
	             |	ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаВалОстаток, 0) - 1000
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Руководитель,
	             |	Магазин
	             |ИТОГИ ПО
	             |	АдресЭП
	             |АВТОУПОРЯДОЧИВАНИЕ";

		Запрос.УстановитьПараметр(	"Период",НачалоДня(ДатаОбработки)+10*60*60+20*60);
	    Запрос.УстановитьПараметр("ТаблицаМайлов",ТаблицаМайлов);

		
	 

	
	
	Результат = Запрос.Выполнить();

	// саУНФ_ОбщийМодуль.ПоказатьВременнуюТаблицу(МВТ, "ВТ_МАГАЗИНЫ") 
	Возврат Результат;
КонецФункции // ()
